MYiR-Dev/myir-imx-linux/drivers/staging/rtl8733bu/core/rtw_pwrctrl.c
		/* When using PNO, the FW may scan first, so polling register 100
		 * may not see 0xEA at this point.
		 */
		if (!pwrctl->wowlan_pno_enable) {
#ifdef CONFIG_USB_HCI
			if (hal_spec->mac_off_access_limit_in_low_clock == _FALSE)
				is_mac_off_access = _TRUE;
			else
				is_mac_off_access = _FALSE;
#endif /* CONFIG_USB_HCI */

			if (is_mac_off_access == _TRUE) {
				do {
					val8 = rtw_read8(padapter, REG_CR);
					polling_cnt++;
					RTW_DBG("%s  polling 0x100=0x%x, cnt=%d\n",
						__func__, val8, polling_cnt);
					RTW_DBG("%s 0x08:%02x, 0x03:%02x\n",
						__func__,
						rtw_read8(padapter, 0x08),
						rtw_read8(padapter, 0x03));
					rtw_mdelay_os(10);
				} while (polling_cnt < 20 && (val8 != 0xEA));
			} else {
				do {
					/* polling mac register 0x8[4]=1 to check that mac */
					/* switches clock to 32K. It was an alternative method */
					/* by RS suggested. */
					val8 = rtw_read8(padapter, REG_SYS_CLK_CTRL);
					polling_cnt++;
					RTW_DBG("%s  polling 0x8=0x%x, cnt=%d\n",
						 __func__, val8, polling_cnt);
					rtw_mdelay_os(10);
				} while (polling_cnt < 20 && ((val8 & BIT(4)) > 0));
			}
		}
	} else {
		/* for polling cpwm */
		rtw_hal_get_hwreg(padapter, HW_VAR_CPWM, &cpwm_orig);

		/* set rpwm to leave 32k */
		rtw_hal_get_hwreg(padapter, HW_VAR_RPWM_TOG, &val8);
		RTW_INFO("%s: read rpwm=%02x\n", __func__, val8);
		val8 += PS_TOGGLE;
		val8 |= PS_ACK;
		rtw_hal_set_hwreg(padapter, HW_VAR_SET_RPWM, (u8 *)(&val8));
		RTW_INFO("%s: write rpwm=%02x\n", __func__, val8);
		pwrctl->tog = (val8 + PS_TOGGLE) & PS_TOGGLE;

		/* do polling cpwm */
		start_time = rtw_get_current_time();
		do {
			rtw_mdelay_os(1);

			rtw_hal_get_hwreg(padapter, HW_VAR_CPWM, &cpwm_now);
			if ((cpwm_orig ^ cpwm_now) & PS_TOGGLE)
				break;

			if (rtw_get_passing_time_ms(start_time) > 100) {
				RTW_INFO("%s: polling cpwm timeout\n",
					__func__);
				break;
			}
		} while (1);

#ifdef CONFIG_PNO_SUPPORT
		if (pwrctl->wowlan_pno_enable) {
			do {
				rtw_mdelay_os(1);

				val8 = rtw_read8(padapter, REG_CR);
				if (val8 != 0xEA) {
					result = _SUCCESS;
					break;
				}

				polling_cnt++;
			} while (polling_cnt < 100);

			if (result == _FAIL )
				RTW_INFO("%s: It is not finished to leave 32K\n",
					__func__);
		}
#endif
	}
}
#endif

#if defined(CONFIG_FWLPS_IN_IPS)
void rtw_set_fw_in_ips_mode(PADAPTER padapter, u8 enable)
{
	struct pwrctrl_priv *pwrpriv = adapter_to_pwrctl(padapter);
	int cnt = 0;
	u8 val8 = 0;
	u8 parm[H2C_INACTIVE_PS_LEN] = {0};

	if (pwrpriv->wowlan_pno_enable) {
		if (padapter->netif_up == _FALSE) {
			RTW_INFO("%s: ERROR, netif is down\n", __func__);
			return;
		}
	}

	/* u8 cmd_param; */ /* BIT0:enable, BIT1:NoConnect32k */
	if (enable) {
#ifdef CONFIG_BT_COEXIST
		rtw_btcoex_IpsNotify(padapter, pwrpriv->ips_mode_req);
#endif
		/* Enter IPS */
		RTW_INFO("%s: issue H2C to FW when entering IPS\n", __func__);

		parm[0] = 0x1;/* suggest by Isaac.Hsu*/
#ifdef CONFIG_PNO_SUPPORT
		if (pwrpriv->wowlan_pno_enable) {
			if (pwrpriv->pno_inited) {
				parm[1] = pwrpriv->pnlo_info->fast_scan_iterations;
				parm[2] = pwrpriv->pnlo_info->slow_scan_period;
			}
		}
#endif

		rtw_hal_fill_h2c_cmd(padapter, /* H2C_FWLPS_IN_IPS_, */
				     H2C_INACTIVE_PS_,
				     H2C_INACTIVE_PS_LEN, parm);
		/* poll 0x1cc to make sure H2C command already finished by FW; MAC_0x1cc=0 means H2C done by FW. */
		do {
			val8 = rtw_read8(padapter, REG_HMETFR);
			cnt++;
			RTW_DBG("%s  polling REG_HMETFR=0x%x, cnt=%d\n",
				 __func__, val8, cnt);
			rtw_mdelay_os(10);
		} while (cnt < 100 && (val8 != 0));

#ifdef CONFIG_LPS_LCLK
		if (rtw_is_fw_ips_lclk_mode(padapter) == _TRUE) {
			if (val8 == 0)
				rtw_set_lps_lclk(padapter, _TRUE);
		}
#endif
	} else {
		/* Leave IPS */
		RTW_INFO("%s: Leaving IPS in FWLPS state\n", __func__);

#ifdef CONFIG_LPS_LCLK
		if (rtw_is_fw_ips_lclk_mode(padapter) == _TRUE)
			rtw_set_lps_lclk(padapter, _FALSE);
#endif
		parm[0] = 0x0;
		parm[1] = 0x0;
		parm[2] = 0x0;
		rtw_hal_fill_h2c_cmd(padapter, H2C_INACTIVE_PS_,
				     H2C_INACTIVE_PS_LEN, parm);
#ifdef CONFIG_BT_COEXIST
		rtw_btcoex_IpsNotify(padapter, IPS_NONE);
#endif
	}
}

u8 rtw_fw_ips_init(_adapter *padapter)
{
	HAL_DATA_TYPE *pHalData = GET_HAL_DATA(padapter);
#ifdef DBG_CONFIG_ERROR_DETECT
	struct sreset_priv *psrtpriv = &pHalData->srestpriv;
#endif /* DBG_CONFIG_ERROR_DETECT */
	struct debug_priv *pdbgpriv = &adapter_to_dvobj(padapter)->drv_dbg;
	struct pwrctrl_priv *pwrpriv = adapter_to_pwrctl(padapter);
	u8 bMacPwrCtrlOn = _TRUE;

	if (pwrpriv->bips_processing == _TRUE &&
#ifdef DBG_CONFIG_ERROR_DETECT
	    psrtpriv->silent_reset_inprogress == _FALSE &&
#endif /* DBG_CONFIG_ERROR_DETECT */
	    pHalData->bFWReady == _TRUE &&
	    pwrpriv->pre_ips_type == 0) {

		rtw_set_fw_in_ips_mode(padapter, _FALSE);
		rtw_hal_set_hwreg(padapter, HW_VAR_APFM_ON_MAC, &bMacPwrCtrlOn);
#ifdef CONFIG_LPS_LCLK
#ifdef DBG_CHECK_FW_PS_STATE
		if (rtw_fw_ps_state(padapter) == _FAIL) {
			RTW_INFO("after hal init, fw ps state in 32k\n");
			pdbgpriv->dbg_ips_drvopen_fail_cnt++;
		}
#endif /* DBG_CHECK_FW_PS_STATE */
#endif /* CONFIG_LPS_LCLK */

		return _SUCCESS;
	}

	return _FAIL;
}

u8 rtw_fw_ips_deinit(_adapter *padapter)
{
	HAL_DATA_TYPE *pHalData = GET_HAL_DATA(padapter);
#ifdef DBG_CONFIG_ERROR_DETECT
	struct sreset_priv *psrtpriv = &pHalData->srestpriv;
#endif /* DBG_CONFIG_ERROR_DETECT */
	struct debug_priv *pdbgpriv = &adapter_to_dvobj(padapter)->drv_dbg;
	struct pwrctrl_priv *pwrpriv = adapter_to_pwrctl(padapter);
	struct hal_spec_t *hal_spec = GET_HAL_SPEC(padapter);
	u8 is_mac_off_access = _TRUE; /* check the off area of mac can be access */

	if (pwrpriv->bips_processing == _TRUE &&
#ifdef DBG_CONFIG_ERROR_DETECT
	    psrtpriv->silent_reset_inprogress == _FALSE &&
#endif /* DBG_CONFIG_ERROR_DETECT */
	    pHalData->bFWReady == _TRUE &&
	    padapter->netif_up == _TRUE) {

		rtw_set_fw_in_ips_mode(padapter, _TRUE);

#ifdef CONFIG_LPS_LCLK
		if(rtw_is_fw_ips_lclk_mode(padapter) == _TRUE) {
#ifdef CONFIG_USB_HCI
			if (hal_spec->mac_off_access_limit_in_low_clock == _FALSE)
				is_mac_off_access = _TRUE;
			else
				is_mac_off_access = _FALSE;
#endif /* CONFIG_USB_HCI */

			if (is_mac_off_access == _TRUE) {
				RTW_INFO("polling done when entering FW_IPS_LCLK, check result : 0x100=0x%x\n",
					 rtw_read8(padapter, REG_CR));
			} else {
				RTW_INFO("polling done when entering FW_IPS_LCLK, check result : 0x8[4]=%d\n",
					 (rtw_read8(padapter, REG_SYS_CLK_CTRL) & BIT(4)) ? 1 : 0);
			}

			pwrpriv->pre_ips_type = 0;
		}
#endif /* CONFIG_LPS_LCLK */

		return _SUCCESS;
	}

	pdbgpriv->dbg_carddisable_cnt++;
	pwrpriv->pre_ips_type = 1;

	return _FAIL;
}
#endif /* CONFIG_FWLPS_IN_IPS */

void rtw_exec_lps(_adapter *padapter, u8 ps_mode)
{
	struct pwrctrl_priv *pwrpriv = adapter_to_pwrctl(padapter);

	if (ps_mode == PS_MODE_ACTIVE) {
#ifdef CONFIG_LPS_ACK
		_enter_critical_mutex(&pwrpriv->lps_ack_mutex, NULL);
		rtw_sctx_init(&pwrpriv->lps_ack_sctx, 100);
#endif /* CONFIG_LPS_ACK */

		rtw_hal_set_hwreg(padapter, HW_VAR_H2C_FW_PWRMODE, (u8 *)(&ps_mode));
		rtw_hal_set_hwreg(padapter, HW_VAR_LPS_STATE_CHK, (u8 *)(&ps_mode));

#ifdef CONFIG_LPS_ACK
		_exit_critical_mutex(&pwrpriv->lps_ack_mutex, NULL);
#endif /* CONFIG_LPS_ACK */
	} else {
		if (MLME_IS_ASOC(padapter))
			rtw_hal_set_hwreg(padapter, HW_VAR_H2C_FW_PWRMODE, (u8 *)(&ps_mode));
		else
			RTW_INFO(FUNC_ADPT_FMT": It can't execute LPS without Wi-Fi connection!\n",
				FUNC_ADPT_ARG(padapter));
	}
}

